In [1]:
import numpy as np
import pandas as pd

In [10]:
labels=['a','b','c']
list=[10,20,30]
d={'a':10,'b':20,'c':23}
arr= np.array(['app','boo','elf'])

In [11]:
pd.Series(list)

0    10
1    20
2    30
dtype: int64

In [18]:
pd.Series(arr)

0    app
1    boo
2    elf
dtype: object

In [15]:
pd.Series(arr,list)

10    app
20    boo
30    elf
dtype: object

In [17]:
ser1=pd.Series([1,2,3,4],index=['aa','bb','cc','dd'])

In [19]:
ser2=pd.Series([4,5,6,7],['aa','bb','cc','dd'])

In [20]:
ser1+ser2

aa     5
bb     7
cc     9
dd    11
dtype: int64

In [33]:
from numpy.random import randn
np.random.seed(100)

In [40]:
df=pd.DataFrame(randn(5,4),index='a b c d e'.split(),columns='W X Y Z'.split())

df

          W         X         Y         Z
a  1.618982  1.541605 -0.251879 -0.842436
b  0.184519  0.937082  0.731000  1.361556
c -0.326238  0.055676  0.222400 -1.443217
d -0.756352  0.816454  0.750445 -0.455947
e  1.189622 -1.690617 -1.356399 -1.232435

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns="W X Y Z".split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df.drop('W',axis=1)

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

In [16]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
df.loc[['A','B']]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502

In [23]:
df.loc['A','W']

0.3026654485851825

In [26]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [30]:
df[(df['Y']<0) |(df['Z']<0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
D -0.497104 -0.754070 -0.943406  0.484752

In [32]:
df[df['X']>0][['Y','Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
E  0.238127  1.996652

In [33]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [42]:
new='HO CHI MIN HOO YAA'.split()

In [65]:
df['new']=new

In [66]:
df

          W         X         Y         Z  new
A  0.302665  1.693723 -1.706086 -1.159119   HO
B -0.134841  0.390528  0.166905  0.184502  CHI
C  0.807706  0.072960  0.638787  0.329646  MIN
D -0.497104 -0.754070 -0.943406  0.484752  HOO
E -0.116773  1.901755  0.238127  1.996652  YAA

In [67]:
df.set_index('new')

            W         X         Y         Z
new
HO   0.302665  1.693723 -1.706086 -1.159119
CHI -0.134841  0.390528  0.166905  0.184502
MIN  0.807706  0.072960  0.638787  0.329646
HOO -0.497104 -0.754070 -0.943406  0.484752
YAA -0.116773  1.901755  0.238127  1.996652

In [71]:
d={'key':['val1','11'],'key2':'val2'}
d

{'key': ['val1', '11'], 'key2': 'val2'}

In [4]:
df3=pd.DataFrame({
    'A': [1,2,np.nan],
     'B': [4,5,80],
    'C':[9,np.nan,np.nan]
    })

In [5]:
df3

     A   B    C
0  1.0   4  9.0
1  2.0   5  NaN
2  NaN  80  NaN

In [6]:
df3.dropna(axis=1)

    B
0   4
1   5
2  80

In [7]:
df3

     A   B    C
0  1.0   4  9.0
1  2.0   5  NaN
2  NaN  80  NaN

In [12]:
df3.dropna(thresh=1)

     A   B    C
0  1.0   4  9.0
1  2.0   5  NaN
2  NaN  80  NaN

In [13]:
df3.fillna("Null")

      A   B     C
0   1.0   4   9.0
1   2.0   5  Null
2  Null  80  Null

In [16]:
df3['A'].fillna(value=df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [17]:
df3['B'].fillna(value=df3['B'].mean())

0     4
1     5
2    80
Name: B, dtype: int64

In [54]:
from numpy.random import randn
np.random.seed(100)

In [55]:
df2=pd.DataFrame(randn(5,4),index='a b c d e'.split(),columns='W X Y Z'.split())
df2

          W         X         Y         Z
a -1.749765  0.342680  1.153036 -0.252436
b  0.981321  0.514219  0.221180 -1.070043
c -0.189496  0.255001 -0.458027  0.435163
d -0.583595  0.816847  0.672721 -0.104411
e -0.531280  1.029733 -0.438136 -1.118318

In [48]:
df[['W','X']].loc['a']

W   -0.544439
X   -0.668172
Name: a, dtype: float64

In [53]:
df['new']=df['W']+ df['X']
df

          W         X         Y         Z       new
a -0.544439 -0.668172  0.007315 -0.612939 -1.212611
b  1.299748 -1.733096 -0.983310  0.357508 -0.433348
c -1.613579  1.470714 -1.188018 -0.549746 -0.142865
d -0.940046 -0.827932  0.108863  0.507810 -1.767979
e -0.862227  1.249470 -0.079611 -0.889731  0.387242

In [55]:
df.drop('new',axis=1)

          W         X         Y         Z
a -0.544439 -0.668172  0.007315 -0.612939
b  1.299748 -1.733096 -0.983310  0.357508
c -1.613579  1.470714 -1.188018 -0.549746
d -0.940046 -0.827932  0.108863  0.507810
e -0.862227  1.249470 -0.079611 -0.889731

In [67]:
df.drop('a',axis=0,inplace=True)

In [69]:
df

          W         X         Y         Z
b  1.299748 -1.733096 -0.983310  0.357508
c -1.613579  1.470714 -1.188018 -0.549746
d -0.940046 -0.827932  0.108863  0.507810
e -0.862227  1.249470 -0.079611 -0.889731

In [71]:
df.loc['c']

W   -1.613579
X    1.470714
Y   -1.188018
Z   -0.549746
Name: c, dtype: float64

In [56]:
new='HO CHI MIN HOO YAA'.split()
df2['states']=new

In [57]:
df2

          W         X         Y         Z states
a -1.749765  0.342680  1.153036 -0.252436     HO
b  0.981321  0.514219  0.221180 -1.070043    CHI
c -0.189496  0.255001 -0.458027  0.435163    MIN
d -0.583595  0.816847  0.672721 -0.104411    HOO
e -0.531280  1.029733 -0.438136 -1.118318    YAA

In [26]:
import pandas as pd

In [27]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [28]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [29]:
df.groupby('Company').mean()

/var/folders/fx/sxss674s30jf3yw9m3qmqvrm0000gn/T/ipykernel_681/2058252646.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [30]:
df.groupby('Company').std()

/var/folders/fx/sxss674s30jf3yw9m3qmqvrm0000gn/T/ipykernel_681/2093150834.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [31]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [32]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [36]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [37]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [38]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [39]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [40]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [41]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [42]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [43]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [44]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [45]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [48]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [47]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [64]:
f = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','gi','xyz']})

In [50]:
f

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [53]:
f['col2'].unique()

array([444, 555, 666])

In [54]:
f['col2'].nunique()

3

In [55]:
f['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [60]:
newf=f[(f['col1']>2) & (f['col2']==444)]

In [61]:
newf

   col1  col2 col3
3     4   444  xyz

In [62]:
def times(x):
    return x*2

In [63]:
f['col1'].apply(times)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [65]:
f['col3'].apply(len)

0    3
1    3
2    2
3    3
Name: col3, dtype: int64

In [67]:
f['col1'].sum()

10

In [68]:
del f['col1']

In [69]:
f

   col2 col3
0   444  abc
1   555  def
2   666   gi
3   444  xyz

In [70]:
f.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666   gi

In [72]:
f.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [76]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [78]:
df.pivot_table('D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [80]:
rCSV=pd.read_csv('example')
rCSV

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [82]:
rCSV.to_csv('csv_out',index=False)

In [85]:
excel=pd.read_excel('Excel_Sample.xlsx',sheetname="Sheet 1")

TypeError: read_excel() got an unexpected keyword argument 'sheetname'

In [86]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

TypeError: read_excel() got an unexpected keyword argument 'sheetname'

In [89]:
df=pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

ValueError: No tables found

In [90]:
df[0]

KeyError: 0